raumzeitlabor/lichtsteuerung-arduino/avr/boards.txt
#lichtsteuerung.name=RaumZeitLabor==============================

##############################################################
#	Added for atmega64 (Digilent Cerebot II)
#	by Mark Sproul Sep 2010
lichtsteuerung.name=RaumZeitLabor Lichtsteuerung Atmega64

lichtsteuerung.upload.protocol=usbasp
lichtsteuerung.upload.maximum_size=57344
lichtsteuerung.upload.speed=115200
lichtsteuerung.upload.tool=arduino:avrdude

lichtsteuerung.bootloader.low_fuses=0xFF
lichtsteuerung.bootloader.high_fuses=0xD9
lichtsteuerung.bootloader.extended_fuses=0xFF
lichtsteuerung.bootloader.path=atmega
lichtsteuerung.bootloader.file=atmega64
lichtsteuerung.bootloader.unlock_bits=0x3F
lichtsteuerung.bootloader.lock_bits=0x0F

lichtsteuerung.build.mcu=atmega64
lichtsteuerung.build.f_cpu=16000000L
lichtsteuerung.build.core=arduino
lichtsteuerung.build.variant=lichtsteuerung

lichtsteuerung.build.board=AVR_LICHTSTEUERUNG
